
<div style="padding:0px 40px 30px; 
            color:#201E20;
            font-size:110%;
            display:fill;
            border-radius:20px;
            border: 5px double;
            border-color:#201E20;
            background-color: #827397;
            overflow:hidden;
            font-weight:450;"> 
<br>
<h1 style = "text-align:center;font-size:20px;">Задачи по SQL на тему анализа инвестиционного рынка</h1>  

База данных основана на датасете Startup Investments, опубликованном на популярной платформе для соревнований по исследованию данных Kaggle.     

</div>

https://pictures.s3.yandex.net/resources/1_Baza_dannykh_1673427255.png - диаграмма базы данных

In [ ]:
# 1.Посчитайте, сколько компаний закрылось.

In [ ]:
'''
SELECT count(status)
FROM company
WHERE status = 'closed'
'''

In [ ]:
# 2.Отобразите количество привлечённых средств для новостных компаний США. 
# Используйте данные из таблицы company. Отсортируйте таблицу по убыванию значений в поле funding_total .

In [ ]:
'''
SELECT funding_total
FROM company
WHERE category_code = 'news' AND country_code = 'USA'
ORDER BY funding_total DESC
'''

In [ ]:
# 3.Найдите общую сумму сделок по покупке одних компаний другими в долларах. 
# Отберите сделки, которые осуществлялись только за наличные с 2011 по 2013 год включительно.

In [ ]:
'''
SELECT sum(price_amount)
FROM acquisition
WHERE term_code = 'cash' AND acquired_at BETWEEN '2011-01-01' AND '2013-12-31'
'''

In [ ]:
# 4.Отобразите имя, фамилию и названия аккаунтов людей в твиттере, у которых названия аккаунтов начинаются на 'Silver'.

In [ ]:
'''
SELECT first_name, last_name, twitter_username
FROM people
WHERE twitter_username LIKE 'Silver%'
'''

In [ ]:
# 5.Выведите на экран всю информацию о людях, у которых названия аккаунтов в твиттере содержат подстроку 'money', а фамилия начинается на 'K'.

In [ ]:
'''
SELECT *
FROM people
WHERE twitter_username LIKE '%money%'
and last_name like 'K%'
'''

In [ ]:
# 6.Для каждой страны отобразите общую сумму привлечённых инвестиций, которые получили компании, зарегистрированные в этой стране. 
# Страну, в которой зарегистрирована компания, можно определить по коду страны. Отсортируйте данные по убыванию суммы.

In [ ]:
'''
SELECT country_code,
       sum(funding_total)
FROM company
GROUP BY country_code
ORDER BY sum(funding_total) DESC
'''

In [ ]:
# 7.Составьте таблицу, в которую войдёт дата проведения раунда, а также минимальное и максимальное значения суммы инвестиций, привлечённых в эту дату.
# Оставьте в итоговой таблице только те записи, в которых минимальное значение суммы инвестиций не равно нулю и не равно максимальному значению.

In [ ]:
'''
SELECT funded_at,
      min(raised_amount),
      max(raised_amount)
FROM funding_round
GROUP BY funded_at
HAVING min(raised_amount) <> 0 AND min(raised_amount) <> max(raised_amount);
'''

In [ ]:
# 8.Создайте поле с категориями:
# Для фондов, которые инвестируют в 100 и более компаний, назначьте категорию high_activity.
# Для фондов, которые инвестируют в 20 и более компаний до 100, назначьте категорию middle_activity.
# Если количество инвестируемых компаний фонда не достигает 20, назначьте категорию low_activity.
# Отобразите все поля таблицы fund и новое поле с категориями.

In [ ]:
'''
SELECT *  ,
CASE 
    WHEN invested_companies > 100 THEN 'high_activity'
    WHEN invested_companies BETWEEN 20 AND 100 THEN 'middle_activity'
    WHEN invested_companies < 20 THEN 'low_activity'
    END
FROM fund
'''

In [ ]:
# 9.
# Для каждой из категорий, назначенных в предыдущем задании, посчитайте округлённое до ближайшего целого числа среднее количество инвестиционных раундов, в которых фонд принимал участие. 
# Выведите на экран категории и среднее число инвестиционных раундов. Отсортируйте таблицу по возрастанию среднего.

In [ ]:
'''
SELECT 
       CASE
           WHEN invested_companies>=100 THEN 'high_activity'
           WHEN invested_companies>=20 THEN 'middle_activity'
           ELSE 'low_activity'
       END AS activity,
       ROUND(AVG(investment_rounds)) 
FROM fund
GROUP BY activity
ORDER BY ROUND(AVG(investment_rounds));
'''

In [ ]:
# 10.
# Проанализируйте, в каких странах находятся фонды, которые чаще всего инвестируют в стартапы. 
# Для каждой страны посчитайте минимальное, максимальное и среднее число компаний, в которые инвестировали фонды этой страны, основанные с 2010 по 2012 год включительно. Исключите страны с фондами, у которых минимальное число компаний, получивших инвестиции, равно нулю. Выгрузите десять самых активных стран-инвесторов.
# Отсортируйте таблицу по среднему количеству компаний от большего к меньшему, а затем по коду страны в лексикографическом порядке.

In [ ]:
'''
SELECT country_code,
               MIN(invested_companies),
                MAX(invested_companies),
                AVG(invested_companies)
FROM fund 
WHERE founded_at BETWEEN '2010-01-01' and '2012-12-31'
GROUP BY country_code
HAVING MIN(invested_companies) <> 0
ORDER BY AVG(invested_companies) DESC, country_code
LIMIT 10
'''

In [ ]:
# 11.Отобразите имя и фамилию всех сотрудников стартапов. Добавьте поле с названием учебного заведения, которое окончил сотрудник, если эта информация известна.

In [ ]:
'''
SELECT p.first_name, p.last_name, e.instituition 
FROM people AS p
LEFT JOIN education AS e ON p.id = e.person_id
'''

In [ ]:
# 12.Для каждой компании найдите количество учебных заведений, которые окончили её сотрудники. Выведите название компании и число уникальных названий учебных заведений. 
# Составьте топ-5 компаний по количеству университетов.

In [ ]:
'''
SELECT c.name,
        count(distinct e.instituition)
FROM education as e
LEFT JOIN people as p on e.person_id  = p.id
LEFT JOIN company as c on p.company_id = c.id
GROUP BY c.name
ORDER BY count(e.instituition) desc
LIMIT 5 OFFSET 1;
'''

In [ ]:
# 13.Составьте список с уникальными названиями закрытых компаний, для которых первый раунд финансирования оказался последним.

In [ ]:
'''
SELECT distinct c.name
FROM company as c
LEFT JOIN funding_round as f on c.id = f.company_id 
WHERE c.status = 'closed' AND is_first_round = is_last_round
'''

In [ ]:
# 14.Составьте список уникальных номеров сотрудников, которые работают в компаниях, отобранных в предыдущем задании.

In [ ]:
'''
SELECT p.id
FROM people AS p
LEFT JOIN company as c ON c.id = p.company_id
WHERE c.name in (SELECT distinct c.name
FROM company as c
LEFT JOIN funding_round as f on c.id = f.company_id 
WHERE c.status = 'closed' AND (is_first_round = 1 AND is_last_round = 1))
'''

In [ ]:
# 15.Составьте таблицу, куда войдут уникальные пары с номерами сотрудников из предыдущей задачи и учебным заведением, которое окончил сотрудник.

In [ ]:
'''
SELECT distinct p.id,
       e.instituition
FROM people AS p
LEFT JOIN  company as c ON c.id = p.company_id
LEFT JOIN education as e ON e.person_id = p.id
WHERE c.name in (SELECT distinct c.name
FROM company as c
LEFT JOIN funding_round as f on c.id = f.company_id 
WHERE c.status = 'closed' AND (is_first_round = 1 AND is_last_round = 1))
AND e.instituition IS NOT NULL
'''

In [ ]:
#  16.Посчитайте количество учебных заведений для каждого сотрудника из предыдущего задания. При подсчёте учитывайте, что некоторые сотрудники могли окончить одно и то же заведение дважды.

In [ ]:
'''
SELECT p.id,
      count(e.instituition)
FROM people AS p
LEFT JOIN company as c ON c.id = p.company_id
LEFT JOIN education as e ON e.person_id = p.id
WHERE c.name in (SELECT distinct c.name
FROM company as c
LEFT JOIN funding_round as f on c.id = f.company_id 
WHERE c.status = 'closed' AND (is_first_round = 1 AND is_last_round = 1))
AND e.instituition IS NOT NULL
GROUP BY p.id
'''

In [ ]:
# 17.Дополните предыдущий запрос и выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники разных компаний.
#  Нужно вывести только одну запись, группировка здесь не понадобится.

In [ ]:
'''
SELECT AVG(i.count_instituition)
FROM (SELECT p.id,
      count(e.instituition) AS count_instituition
FROM people AS p
LEFT JOIN company as c ON c.id = p.company_id
LEFT JOIN education as e ON e.person_id = p.id
WHERE c.name in (SELECT distinct c.name
FROM company as c
LEFT JOIN funding_round as f on c.id = f.company_id 
WHERE c.status = 'closed' AND (is_first_round = 1 AND is_last_round = 1))
AND e.instituition IS NOT NULL
GROUP BY p.id) AS i;
'''

In [ ]:
# 18.Напишите похожий запрос: выведите среднее число учебных заведений (всех, не только уникальных), которые окончили сотрудники Facebook*.

In [ ]:
'''
SELECT AVG(i.count_instituition)
FROM (
    SELECT p.id,
      count(e.instituition) AS count_instituition
FROM people AS p
LEFT JOIN company as c ON c.id = p.company_id
LEFT JOIN education as e ON e.person_id = p.id
WHERE c.name = 'Facebook'
GROUP BY p.id
HAVING count(e.instituition) <> 0
) AS i;
'''

In [ ]:
# 19.Составьте таблицу из полей:
# name_of_fund — название фонда;
# name_of_company — название компании;
# amount — сумма инвестиций, которую привлекла компания в раунде.
# В таблицу войдут данные о компаниях, в истории которых было больше шести важных этапов, а раунды финансирования проходили с 2012 по 2013 год включительно.

In [ ]:
'''
SELECT f.name as name_of_fund,
       c.name as name_of_company,
       fr.raised_amount as amount
FROM investment as i
LEFT JOIN company as c on i.company_id = c.id
LEFT JOIN fund as f on i.fund_id = f.id
INNER JOIN (select * from funding_round where funded_at between '2012-01-01' and '2013-12-31') as fr 
on i.funding_round_id = fr.id
WHERE c.milestones > 6 ;
'''

In [ ]:
# 20.Выгрузите таблицу, в которой будут такие поля:
# название компании-покупателя;
# сумма сделки;
# название компании, которую купили;
# сумма инвестиций, вложенных в купленную компанию;
# доля, которая отображает, во сколько раз сумма покупки превысила сумму вложенных в компанию инвестиций, округлённая до ближайшего целого числа.
# Не учитывайте те сделки, в которых сумма покупки равна нулю. Если сумма инвестиций в компанию равна нулю, исключите такую компанию из таблицы. 
# Отсортируйте таблицу по сумме сделки от большей к меньшей, а затем по названию купленной компании в лексикографическом порядке. Ограничьте таблицу первыми десятью записями.

In [ ]:
'''
SELECT buyer.name AS buyer_company,
       ac.price_amount,
       seller.name AS seller_company,
       seller.funding_total,
       round(ac.price_amount/seller.funding_total)
FROM acquisition as ac
LEFT JOIN company as buyer on ac.acquiring_company_id = buyer.id
LEFT JOIN company as seller on ac.acquired_company_id = seller.id
WHERE ac.price_amount <> 0 and seller.funding_total > 0
ORDER BY ac.price_amount desc, seller_company
LIMIT 10
'''

In [ ]:
# 21.Выгрузите таблицу, в которую войдут названия компаний из категории social, получившие финансирование с 2010 по 2013 год включительно. 
# Проверьте, что сумма инвестиций не равна нулю. Выведите также номер месяца, в котором проходил раунд финансирования.

In [ ]:
'''
SELECT c.name,
       extract(MONTH FROM fr.funded_at)
FROM company as c
LEFT JOIN funding_round as fr on c.id = fr.company_id
WHERE (c.category_code = 'social')
and (fr.funded_at between '2010-01-01' and '2013-12-31')
and (fr.raised_amount <> 0)
'''

In [ ]:
# 22.Отберите данные по месяцам с 2010 по 2013 год, когда проходили инвестиционные раунды. Сгруппируйте данные по номеру месяца и получите таблицу, в которой будут поля:
# номер месяца, в котором проходили раунды;
# количество уникальных названий фондов из США, которые инвестировали в этом месяце;
# количество компаний, купленных за этот месяц;
# общая сумма сделок по покупкам в этом месяце.

In [ ]:
'''
WITH
-- выбираем месяц инвестиционных раундов в 2010-2013 гг
tab1 AS (SELECT EXTRACT(MONTH FROM funded_at) AS month,
                id AS funding_round_id
                FROM funding_round
         WHERE EXTRACT(YEAR FROM funded_at) BETWEEN 2010 AND 2013
         ),
-- считаем кол-во купленных и общую сумму по сделкам за 2010-2013 гг в разрезе месяца
tab2 AS (SELECT EXTRACT(MONTH FROM acquired_at) AS month,
                COUNT(acquired_company_id) AS count_acquired,
                SUM(price_amount) AS total_amount
         FROM acquisition
         WHERE EXTRACT(YEAR FROM acquired_at) BETWEEN 2010 AND 2013
         GROUP BY EXTRACT(MONTH FROM acquired_at)
        ),
-- ищем фонды из США
tab3 AS (SELECT i.funding_round_id,
                f.name
        FROM investment AS i
        JOIN fund AS f ON f.id = i.fund_id
        WHERE fund_id IN (SELECT id
                          FROM fund
                          WHERE country_code LIKE 'USA')
        ),
tab4 AS (SELECT month,
                COUNT(DISTINCT name) AS count_USA
         FROM tab1 
         LEFT JOIN tab3 ON tab1.funding_round_id = tab3.funding_round_id
         GROUP BY month)        
SELECT tab4.month,
       tab4.count_USA,
       tab2.count_acquired,
       tab2.total_amount
FROM tab4 
LEFT JOIN tab2 ON tab4.month = tab2.month;
'''

In [ ]:
# 23.Составьте сводную таблицу и выведите среднюю сумму инвестиций для стран, в которых есть стартапы, зарегистрированные в 2011, 2012 и 2013 годах. 
# Данные за каждый год должны быть в отдельном поле. Отсортируйте таблицу по среднему значению инвестиций за 2011 год от большего к меньшему.

In [ ]:
'''
WITH
total_11 AS (SELECT AVG(funding_total) AS total_2011,
                      country_code
               FROM company
               GROUP BY country_code,
               EXTRACT(YEAR FROM founded_at)
               HAVING EXTRACT(YEAR FROM founded_at) = 2011),              
total_12 AS (SELECT AVG(funding_total) AS total_2012,
                      country_code
               FROM company
               GROUP BY country_code,
               EXTRACT(YEAR FROM founded_at)
               HAVING EXTRACT(YEAR FROM founded_at) = 2012),
total_13 AS (SELECT AVG(funding_total) AS total_2013,
                      country_code
               FROM company
               GROUP BY country_code,
               EXTRACT(YEAR FROM founded_at)
               HAVING EXTRACT(YEAR FROM founded_at) = 2013)
SELECT total_11.country_code,
       total_11.total_2011,
       total_12.total_2012,
       total_13.total_2013
FROM total_11 
INNER JOIN total_12 ON total_11.country_code = total_12.country_code
INNER JOIN total_13 ON total_11.country_code = total_13.country_code
ORDER BY total_11.total_2011 DESC;
'''